In [13]:
import pandas as pd
import numpy as np

df = pd.read_excel(open('/Users/jay.ghorbani/Desktop/Neo_temp.xlsx','rb'), sheet_name='Sheet1')
df.head()

   name    company
0   Jay  Accenture
1   Rob   Facebook
2   Tom     Google
3  Jess   Twitter

In [14]:
df['Individual_query']=""
df['Company_query']=""
df['Rel_query']=""
df

   name    company Individual_query Company_query Rel_query
0   Jay  Accenture
1   Rob   Facebook
2   Tom     Google
3  Jess   Twitter

In [15]:
for index, row in df.iterrows():  
    print(index,'------',row['company'])
    df['Individual_query'][index]="MERGE(n:Individual {name:'%s'})"%(row['name'])
    df['Company_query'][index]="MERGE(n:Company {name:'%s'})"%(row['company'])
    df['Rel_query'][index]="MATCH (n1:Individual {name:'%s'}),(n2:Company {name:'%s'}) MERGE (n1)-[r:WORKS_IN]->(n2)"%(row['name'],row['company'])
df

0 ------ Accenture
1 ------ Facebook
2 ------ Google
3 ------ Twitter

,name,company,Individual_query,Company_query,Rel_query
0,Jay,Accenture,MERGE(n:Individual {name:'Jay'}),MERGE(n:Company {name:'Accenture'}),"MATCH (n1:Individual {name:'Jay'}),(n2:Company..."
1,Rob,Facebook,MERGE(n:Individual {name:'Rob'}),MERGE(n:Company {name:'Facebook'}),"MATCH (n1:Individual {name:'Rob'}),(n2:Company..."
2,Tom,Google,MERGE(n:Individual {name:'Tom'}),MERGE(n:Company {name:'Google'}),"MATCH (n1:Individual {name:'Tom'}),(n2:Company..."
3,Jess,Twitter,MERGE(n:Individual {name:'Jess'}),MERGE(n:Company {name:'Twitter '}),"MATCH (n1:Individual {name:'Jess'}),(n2:Compan..."

## Ingest into Graph from here

In [16]:
# How to install this package? type this "pip install neo4j-driver" in your terminal  ==> then run the rest
from neo4j.v1 import GraphDatabase

uri = "bolt://localhost:7687"
driver = GraphDatabase.driver(uri, auth=("neo4j", "mjgh2765"))

In [17]:
for index, row in df.iterrows():
    with driver.session() as session:      
        result = session.run(row['Individual_query'])
        result = session.run(row['Company_query'])
        result = session.run(row['Rel_query'])